&НаКлиенте
Процедура РежимПриИзменении(Элемент)
	
	Если Объект.Режим = ПредопределенноеЗначение("Перечисление.РежимыИБ.Файловый") Тогда
		ЭтаФорма.Элементы.Сервер.Видимость = Ложь;
		ЭтаФорма.Элементы.ИмяБазы.Видимость = Ложь;
		ЭтаФорма.Элементы.Каталог.Видимость = Истина;
	Иначе
		ЭтаФорма.Элементы.Сервер.Видимость = Истина;
		ЭтаФорма.Элементы.ИмяБазы.Видимость = Истина;
		ЭтаФорма.Элементы.Каталог.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтоКопияПриИзменении(Элемент)
	
КонецПроцедуры
